<script setup lang="ts">

import PageTitle from '../../ui/PageTitle.vue';
const tasks = [
    [
        '1', 'Учимся работать с графиками', 7
    ],
    [
        '4', 'Условие Фано и бинарные деревья', 14
    ],
    [
        '7', 'Формулы, работа с файлами, единицы измерения', 20
    ],
    [
        '11', 'Формулы, единицы измерения', 27
    ],
    [
        '2', 'Разбираемся с Python, основы дискретной математики', 34
    ],
    [
        '6', 'Python, модуль черепаха', 40
    ],
    [
        '16', 'Понятие функций и рекурсия', 43
    ],
    [
        '23', 'Функции, рекурсия, перебор вариантов', 46
    ],
    [
        '3', 'Excel. Фильтрация, сортировка, ВПР', 48
    ],
    [
        '10', 'Word, инструменты поиска', 51 
    ],
    [
        '18', 'Excel. Сбор монет, ювелирная работа', 54
    ],
    [
        '19', 'Теория игр. База', 56
    ],
    [
        '20', 'Теория игр, чуть сложнее', 59
    ],
    // стоп скромник
    [
        '21', 'Теория игр, ещё сложнее', 62
    ],
    [
        '5', 'Системы счисления, функции, циклы', 64
    ],
    [
        '12', 'Строки, циклы, методы', 67
    ],
    [
        '14', 'Системы счисления, много подтипов', 70
    ],
    [
        '15', 'Флаг, вложенные циклы', 72
    ],
    [
        '8', 'Комбинаторика, питончик', 75
    ],
    [
        '9', 'Логика, формулы, excel', 78
    ],
    [
        '13', 'IP адреса и вообще жуть какая-то', '80'
    ],
    [
        '17', 'Циклы, файлы, подсчеты', '83'
    ],
    [
        '25', 'Алгоритм Евклида, вторая часть!', '85'
    ],
    [
        '24', 'Выражения, txt, хардкор, вторая часть!', '88 или 90'
    ],
    [
        '26', 'Хардкор', '93 или 95'
    ],
    [
        '27', 'Без комментариев..', '98 или 100'
    ]
];
</script>

<!-- <template>
    <div class="plan">
        <PageTitle title="План подготовки"/>

        <h2>Определитесь со своим планом подготовки, следите за прогрессом в течение года</h2>

        <div class="list">

            <div class="item">
                <h3>Скромник, 59 баллов</h3>

                <div class="item__list">

                </div>
            </div>


        </div>


    </div>
</template> -->

<template>
  <div class="timeline">

    <CCard
        v-for="([number, description, score], index) in tasks"
        :key="index"
        class="text-center card"
    >
        <CCardHeader>Задание № {{number}}</CCardHeader>
        <CCardBody>
            <CCardTitle>{{ index + 1}}/27</CCardTitle>
            <CCardText>{{ description }}</CCardText>
        </CCardBody>
        <CCardFooter class="text-body-secondary">{{ score }} из 100</CCardFooter>
    </CCard>

  </div>
</template>

<style scoped>
    .timeline {
        max-width: 600px;
        margin: 0 auto;
        margin-top: 20px;
    }

    .card {
        margin-bottom: 30px;
    }
</style>